gw826943555/hal_gigadevice/include/dt-bindings/pinctrl/gd32f527i(m-s)xx-pinctrl.h
/* EXMC_A1 */
#define EXMC_A1_PF1 \
	GD32_PINMUX_AF('F', 1, AF12)

/* EXMC_A10 */
#define EXMC_A10_PG0 \
	GD32_PINMUX_AF('G', 0, AF12)

/* EXMC_A11 */
#define EXMC_A11_PG1 \
	GD32_PINMUX_AF('G', 1, AF12)

/* EXMC_A12 */
#define EXMC_A12_PG2 \
	GD32_PINMUX_AF('G', 2, AF12)

/* EXMC_A13 */
#define EXMC_A13_PG3 \
	GD32_PINMUX_AF('G', 3, AF12)

/* EXMC_A14 */
#define EXMC_A14_PG4 \
	GD32_PINMUX_AF('G', 4, AF12)

/* EXMC_A15 */
#define EXMC_A15_PG5 \
	GD32_PINMUX_AF('G', 5, AF12)

/* EXMC_A16 */
#define EXMC_A16_PD11 \
	GD32_PINMUX_AF('D', 11, AF12)

/* EXMC_A17 */
#define EXMC_A17_PD12 \
	GD32_PINMUX_AF('D', 12, AF12)

/* EXMC_A18 */
#define EXMC_A18_PD13 \
	GD32_PINMUX_AF('D', 13, AF12)

/* EXMC_A19 */
#define EXMC_A19_PE3 \
	GD32_PINMUX_AF('E', 3, AF12)

/* EXMC_A2 */
#define EXMC_A2_PF2 \
	GD32_PINMUX_AF('F', 2, AF12)

/* EXMC_A20 */
#define EXMC_A20_PE4 \
	GD32_PINMUX_AF('E', 4, AF12)

/* EXMC_A21 */
#define EXMC_A21_PE5 \
	GD32_PINMUX_AF('E', 5, AF12)

/* EXMC_A22 */
#define EXMC_A22_PE6 \
	GD32_PINMUX_AF('E', 6, AF12)

/* EXMC_A23 */
#define EXMC_A23_PE2 \
	GD32_PINMUX_AF('E', 2, AF12)

/* EXMC_A24 */
#define EXMC_A24_PG13 \
	GD32_PINMUX_AF('G', 13, AF12)

/* EXMC_A25 */
#define EXMC_A25_PG14 \
	GD32_PINMUX_AF('G', 14, AF12)

/* EXMC_A3 */
#define EXMC_A3_PF3 \
	GD32_PINMUX_AF('F', 3, AF12)

/* EXMC_A4 */
#define EXMC_A4_PF4 \
	GD32_PINMUX_AF('F', 4, AF12)

/* EXMC_A5 */
#define EXMC_A5_PF5 \
	GD32_PINMUX_AF('F', 5, AF12)

/* EXMC_A6 */
#define EXMC_A6_PF12 \
	GD32_PINMUX_AF('F', 12, AF12)

/* EXMC_A7 */
#define EXMC_A7_PF13 \
	GD32_PINMUX_AF('F', 13, AF12)

/* EXMC_A8 */
#define EXMC_A8_PF14 \
	GD32_PINMUX_AF('F', 14, AF12)

/* EXMC_A9 */
#define EXMC_A9_PF15 \
	GD32_PINMUX_AF('F', 15, AF12)

/* EXMC_ALE */
#define EXMC_ALE_PD12 \
	GD32_PINMUX_AF('D', 12, AF12)

/* EXMC_CD */
#define EXMC_CD_PF9 \
	GD32_PINMUX_AF('F', 9, AF12)

/* EXMC_CLE */
#define EXMC_CLE_PD11 \
	GD32_PINMUX_AF('D', 11, AF12)

/* EXMC_CLK */
#define EXMC_CLK_PD3 \
	GD32_PINMUX_AF('D', 3, AF12)

/* EXMC_D0 */
#define EXMC_D0_PD14 \
	GD32_PINMUX_AF('D', 14, AF12)

/* EXMC_D1 */
#define EXMC_D1_PD15 \
	GD32_PINMUX_AF('D', 15, AF12)

/* EXMC_D10 */
#define EXMC_D10_PE13 \
	GD32_PINMUX_AF('E', 13, AF12)

/* EXMC_D11 */
#define EXMC_D11_PE14 \
	GD32_PINMUX_AF('E', 14, AF12)

/* EXMC_D12 */
#define EXMC_D12_PE15 \
	GD32_PINMUX_AF('E', 15, AF12)

/* EXMC_D13 */
#define EXMC_D13_PD8 \
	GD32_PINMUX_AF('D', 8, AF12)

/* EXMC_D14 */
#define EXMC_D14_PD9 \
	GD32_PINMUX_AF('D', 9, AF12)

/* EXMC_D15 */
#define EXMC_D15_PD10 \
	GD32_PINMUX_AF('D', 10, AF12)

/* EXMC_D16 */
#define EXMC_D16_PH8 \
	GD32_PINMUX_AF('H', 8, AF12)

/* EXMC_D17 */
#define EXMC_D17_PH9 \
	GD32_PINMUX_AF('H', 9, AF12)

/* EXMC_D18 */
#define EXMC_D18_PH10 \
	GD32_PINMUX_AF('H', 10, AF12)

/* EXMC_D19 */
#define EXMC_D19_PH11 \
	GD32_PINMUX_AF('H', 11, AF12)

/* EXMC_D2 */
#define EXMC_D2_PD0 \
	GD32_PINMUX_AF('D', 0, AF12)

/* EXMC_D20 */
#define EXMC_D20_PH12 \
	GD32_PINMUX_AF('H', 12, AF12)

/* EXMC_D21 */
#define EXMC_D21_PH13 \
	GD32_PINMUX_AF('H', 13, AF12)

/* EXMC_D22 */
#define EXMC_D22_PH14 \
	GD32_PINMUX_AF('H', 14, AF12)

/* EXMC_D23 */
#define EXMC_D23_PH15 \
	GD32_PINMUX_AF('H', 15, AF12)

/* EXMC_D24 */
#define EXMC_D24_PI0 \
	GD32_PINMUX_AF('I', 0, AF12)

/* EXMC_D25 */
#define EXMC_D25_PI1 \
	GD32_PINMUX_AF('I', 1, AF12)

/* EXMC_D26 */
#define EXMC_D26_PI2 \
	GD32_PINMUX_AF('I', 2, AF12)

/* EXMC_D27 */
#define EXMC_D27_PI3 \
	GD32_PINMUX_AF('I', 3, AF12)

/* EXMC_D28 */
#define EXMC_D28_PI6 \
	GD32_PINMUX_AF('I', 6, AF12)

/* EXMC_D29 */
#define EXMC_D29_PI7 \
	GD32_PINMUX_AF('I', 7, AF12)

/* EXMC_D3 */
#define EXMC_D3_PD1 \
	GD32_PINMUX_AF('D', 1, AF12)

/* EXMC_D30 */
#define EXMC_D30_PI9 \
	GD32_PINMUX_AF('I', 9, AF12)

/* EXMC_D31 */
#define EXMC_D31_PI10 \
	GD32_PINMUX_AF('I', 10, AF12)

/* EXMC_D4 */
#define EXMC_D4_PE7 \
	GD32_PINMUX_AF('E', 7, AF12)

/* EXMC_D5 */
#define EXMC_D5_PE8 \
	GD32_PINMUX_AF('E', 8, AF12)

/* EXMC_D6 */
#define EXMC_D6_PE9 \
	GD32_PINMUX_AF('E', 9, AF12)

/* EXMC_D7 */
#define EXMC_D7_PE10 \
	GD32_PINMUX_AF('E', 10, AF12)

/* EXMC_D8 */
#define EXMC_D8_PE11 \
	GD32_PINMUX_AF('E', 11, AF12)

/* EXMC_D9 */
#define EXMC_D9_PE12 \
	GD32_PINMUX_AF('E', 12, AF12)

/* EXMC_INT1 */
#define EXMC_INT1_PG6 \
	GD32_PINMUX_AF('G', 6, AF12)

/* EXMC_INT2 */
#define EXMC_INT2_PG7 \
	GD32_PINMUX_AF('G', 7, AF12)

/* EXMC_INTR */
#define EXMC_INTR_PF10 \
	GD32_PINMUX_AF('F', 10, AF12)

/* EXMC_NBL0 */
#define EXMC_NBL0_PE0 \
	GD32_PINMUX_AF('E', 0, AF12)

/* EXMC_NBL1 */
#define EXMC_NBL1_PE1 \
	GD32_PINMUX_AF('E', 1, AF12)

/* EXMC_NBL2 */
#define EXMC_NBL2_PI4 \
	GD32_PINMUX_AF('I', 4, AF12)

/* EXMC_NBL3 */
#define EXMC_NBL3_PI5 \
	GD32_PINMUX_AF('I', 5, AF12)

/* EXMC_NCE1 */
#define EXMC_NCE1_PD7 \
	GD32_PINMUX_AF('D', 7, AF12)

/* EXMC_NCE2 */
#define EXMC_NCE2_PG9 \
	GD32_PINMUX_AF('G', 9, AF12)

/* EXMC_NCE3_0 */
#define EXMC_NCE3_0_PG10 \
	GD32_PINMUX_AF('G', 10, AF12)

/* EXMC_NCE3_1 */
#define EXMC_NCE3_1_PG11 \
	GD32_PINMUX_AF('G', 11, AF12)

/* EXMC_NE0 */
#define EXMC_NE0_PD7 \
	GD32_PINMUX_AF('D', 7, AF12)

/* EXMC_NE1 */
#define EXMC_NE1_PG9 \
	GD32_PINMUX_AF('G', 9, AF12)

/* EXMC_NE2 */
#define EXMC_NE2_PG10 \
	GD32_PINMUX_AF('G', 10, AF12)

/* EXMC_NE3 */
#define EXMC_NE3_PG12 \
	GD32_PINMUX_AF('G', 12, AF12)

/* EXMC_NIORD */
#define EXMC_NIORD_PF6 \
	GD32_PINMUX_AF('F', 6, AF12)

/* EXMC_NIOWR */
#define EXMC_NIOWR_PF8 \
	GD32_PINMUX_AF('F', 8, AF12)

/* EXMC_NL */
#define EXMC_NL_PB7 \
	GD32_PINMUX_AF('B', 7, AF12)

/* EXMC_NOE */
#define EXMC_NOE_PD4 \
	GD32_PINMUX_AF('D', 4, AF12)

/* EXMC_NREG */
#define EXMC_NREG_PF7 \
	GD32_PINMUX_AF('F', 7, AF12)

/* EXMC_NWAIT */
#define EXMC_NWAIT_PD6 \
	GD32_PINMUX_AF('D', 6, AF12)

/* EXMC_NWE */
#define EXMC_NWE_PD5 \
	GD32_PINMUX_AF('D', 5, AF12)

/* EXMC_SDCKE0 */
#define EXMC_SDCKE0_PC3 \
	GD32_PINMUX_AF('C', 3, AF12)
#define EXMC_SDCKE0_PC5 \
	GD32_PINMUX_AF('C', 5, AF12)
#define EXMC_SDCKE0_PH2 \
	GD32_PINMUX_AF('H', 2, AF12)

/* EXMC_SDCKE1 */
#define EXMC_SDCKE1_PB5 \
	GD32_PINMUX_AF('B', 5, AF12)
#define EXMC_SDCKE1_PH7 \
	GD32_PINMUX_AF('H', 7, AF12)

