gw826943555/hal_gigadevice/include/dt-bindings/pinctrl/gd32f527i(m-s)xx-pinctrl.h
/* EXMC_SDCLK */
#define EXMC_SDCLK_PG8 \
	GD32_PINMUX_AF('G', 8, AF12)

/* EXMC_SDNCAS */
#define EXMC_SDNCAS_PG15 \
	GD32_PINMUX_AF('G', 15, AF12)

/* EXMC_SDNE0 */
#define EXMC_SDNE0_PC2 \
	GD32_PINMUX_AF('C', 2, AF12)
#define EXMC_SDNE0_PC4 \
	GD32_PINMUX_AF('C', 4, AF12)
#define EXMC_SDNE0_PH3 \
	GD32_PINMUX_AF('H', 3, AF12)

/* EXMC_SDNE1 */
#define EXMC_SDNE1_PB6 \
	GD32_PINMUX_AF('B', 6, AF12)
#define EXMC_SDNE1_PH6 \
	GD32_PINMUX_AF('H', 6, AF12)

/* EXMC_SDNRAS */
#define EXMC_SDNRAS_PF11 \
	GD32_PINMUX_AF('F', 11, AF12)

/* EXMC_SDNWE */
#define EXMC_SDNWE_PA7 \
	GD32_PINMUX_AF('A', 7, AF12)
#define EXMC_SDNWE_PC0 \
	GD32_PINMUX_AF('C', 0, AF12)
#define EXMC_SDNWE_PH5 \
	GD32_PINMUX_AF('H', 5, AF12)

/* I2C0_SCL */
#define I2C0_SCL_PB6 \
	GD32_PINMUX_AF('B', 6, AF4)
#define I2C0_SCL_PB8 \
	GD32_PINMUX_AF('B', 8, AF4)

/* I2C0_SDA */
#define I2C0_SDA_PB7 \
	GD32_PINMUX_AF('B', 7, AF4)
#define I2C0_SDA_PB9 \
	GD32_PINMUX_AF('B', 9, AF4)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AF('B', 5, AF4)

/* I2C0_TXFRAME */
#define I2C0_TXFRAME_PB4 \
	GD32_PINMUX_AF('B', 4, AF4)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AF('B', 10, AF4)
#define I2C1_SCL_PF1 \
	GD32_PINMUX_AF('F', 1, AF4)
#define I2C1_SCL_PH4 \
	GD32_PINMUX_AF('H', 4, AF4)

/* I2C1_SDA */
#define I2C1_SDA_PB3 \
	GD32_PINMUX_AF('B', 3, AF9)
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AF('B', 11, AF4)
#define I2C1_SDA_PC12 \
	GD32_PINMUX_AF('C', 12, AF4)
#define I2C1_SDA_PF0 \
	GD32_PINMUX_AF('F', 0, AF4)
#define I2C1_SDA_PH5 \
	GD32_PINMUX_AF('H', 5, AF4)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AF('B', 12, AF4)
#define I2C1_SMBA_PF2 \
	GD32_PINMUX_AF('F', 2, AF4)
#define I2C1_SMBA_PH6 \
	GD32_PINMUX_AF('H', 6, AF4)

/* I2C1_TXFRAME */
#define I2C1_TXFRAME_PB13 \
	GD32_PINMUX_AF('B', 13, AF4)
#define I2C1_TXFRAME_PF3 \
	GD32_PINMUX_AF('F', 3, AF4)
#define I2C1_TXFRAME_PH3 \
	GD32_PINMUX_AF('H', 3, AF4)

/* I2C2_SCL */
#define I2C2_SCL_PA8 \
	GD32_PINMUX_AF('A', 8, AF4)
#define I2C2_SCL_PH7 \
	GD32_PINMUX_AF('H', 7, AF4)

/* I2C2_SDA */
#define I2C2_SDA_PB4 \
	GD32_PINMUX_AF('B', 4, AF9)
#define I2C2_SDA_PC9 \
	GD32_PINMUX_AF('C', 9, AF4)
#define I2C2_SDA_PH8 \
	GD32_PINMUX_AF('H', 8, AF4)

/* I2C2_SMBA */
#define I2C2_SMBA_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)
#define I2C2_SMBA_PH9 \
	GD32_PINMUX_AF('H', 9, AF4)

/* I2C2_TXFRAME */
#define I2C2_TXFRAME_PA10 \
	GD32_PINMUX_AF('A', 10, AF4)
#define I2C2_TXFRAME_PH10 \
	GD32_PINMUX_AF('H', 10, AF4)

/* I2C3_SCL */
#define I2C3_SCL_PF14 \
	GD32_PINMUX_AF('F', 14, AF4)
#define I2C3_SCL_PG1 \
	GD32_PINMUX_AF('G', 1, AF4)

/* I2C3_SDA */
#define I2C3_SDA_PA3 \
	GD32_PINMUX_AF('A', 3, AF4)
#define I2C3_SDA_PF15 \
	GD32_PINMUX_AF('F', 15, AF4)
#define I2C3_SDA_PG0 \
	GD32_PINMUX_AF('G', 0, AF4)

/* I2C3_SMBA */
#define I2C3_SMBA_PF13 \
	GD32_PINMUX_AF('F', 13, AF4)
#define I2C3_SMBA_PH8 \
	GD32_PINMUX_AF('H', 8, AF5)

/* I2C4_SCL */
#define I2C4_SCL_PF1 \
	GD32_PINMUX_AF('F', 1, AF6)
#define I2C4_SCL_PG7 \
	GD32_PINMUX_AF('G', 7, AF6)
#define I2C4_SCL_PG14 \
	GD32_PINMUX_AF('G', 14, AF4)

/* I2C4_SDA */
#define I2C4_SDA_PF0 \
	GD32_PINMUX_AF('F', 0, AF6)
#define I2C4_SDA_PG8 \
	GD32_PINMUX_AF('G', 8, AF6)

/* I2C4_SMBA */
#define I2C4_SMBA_PF2 \
	GD32_PINMUX_AF('F', 2, AF6)
#define I2C4_SMBA_PG6 \
	GD32_PINMUX_AF('G', 6, AF6)

/* I2C5_SCL */
#define I2C5_SCL_PF11 \
	GD32_PINMUX_AF('F', 11, AF4)
#define I2C5_SCL_PI5 \
	GD32_PINMUX_AF('I', 5, AF4)

/* I2C5_SDA */
#define I2C5_SDA_PF12 \
	GD32_PINMUX_AF('F', 12, AF4)
#define I2C5_SDA_PI7 \
	GD32_PINMUX_AF('I', 7, AF4)

/* I2C5_SMBA */
#define I2C5_SMBA_PF10 \
	GD32_PINMUX_AF('F', 10, AF4)
#define I2C5_SMBA_PG15 \
	GD32_PINMUX_AF('G', 15, AF4)

/* I2S1_ADD_SD */
#define I2S1_ADD_SD_PB14 \
	GD32_PINMUX_AF('B', 14, AF6)
#define I2S1_ADD_SD_PC2 \
	GD32_PINMUX_AF('C', 2, AF6)
#define I2S1_ADD_SD_PI2 \
	GD32_PINMUX_AF('I', 2, AF6)

/* I2S1_CK */
#define I2S1_CK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define I2S1_CK_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define I2S1_CK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define I2S1_CK_PC7 \
	GD32_PINMUX_AF('C', 7, AF5)
#define I2S1_CK_PD3 \
	GD32_PINMUX_AF('D', 3, AF5)
#define I2S1_CK_PI1 \
	GD32_PINMUX_AF('I', 1, AF5)

/* I2S1_MCK */
#define I2S1_MCK_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)
#define I2S1_MCK_PA6 \
	GD32_PINMUX_AF('A', 6, AF6)
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AF('C', 6, AF5)

/* I2S1_SD */
#define I2S1_SD_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define I2S1_SD_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define I2S1_SD_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)
#define I2S1_SD_PI3 \
	GD32_PINMUX_AF('I', 3, AF5)

/* I2S1_WS */
#define I2S1_WS_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define I2S1_WS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)
#define I2S1_WS_PD1 \
	GD32_PINMUX_AF('D', 1, AF7)
#define I2S1_WS_PI0 \
	GD32_PINMUX_AF('I', 0, AF5)

/* I2S2_ADD_SD */
#define I2S2_ADD_SD_PB4 \
	GD32_PINMUX_AF('B', 4, AF7)
#define I2S2_ADD_SD_PC11 \
	GD32_PINMUX_AF('C', 11, AF5)

/* I2S2_CK */
#define I2S2_CK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define I2S2_CK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* I2S2_MCK */
#define I2S2_MCK_PB10 \
	GD32_PINMUX_AF('B', 10, AF6)
#define I2S2_MCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF6)

/* I2S2_SD */
#define I2S2_SD_PB0 \
	GD32_PINMUX_AF('B', 0, AF7)
#define I2S2_SD_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define I2S2_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define I2S2_SD_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define I2S2_SD_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)
#define I2S2_SD_PD0 \
	GD32_PINMUX_AF('D', 0, AF6)
#define I2S2_SD_PD6 \
	GD32_PINMUX_AF('D', 6, AF5)

/* I2S2_WS */
#define I2S2_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define I2S2_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

/* I2S_CKIN */
#define I2S_CKIN_PA2 \
	GD32_PINMUX_AF('A', 2, AF5)
#define I2S_CKIN_PB11 \
	GD32_PINMUX_AF('B', 11, AF5)
#define I2S_CKIN_PC9 \
	GD32_PINMUX_AF('C', 9, AF5)

/* IREF */
#define IREF_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* JNTRST */
#define JNTRST_PB4 \
	GD32_PINMUX_AF('B', 4, AF0)

/* JTCK */
#define JTCK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* JTDI */
#define JTDI_PA15 \
	GD32_PINMUX_AF('A', 15, AF0)

/* JTDO */
#define JTDO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* JTMS */
#define JTMS_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

