gw826943555/hal_gigadevice/include/dt-bindings/pinctrl/gd32f527i(m-s)xx-pinctrl.h
/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)
#define TIMER4_CH2_PH12 \
	GD32_PINMUX_AF('H', 12, AF2)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)
#define TIMER4_CH3_PI0 \
	GD32_PINMUX_AF('I', 0, AF2)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF3)
#define TIMER7_BRKIN_PI4 \
	GD32_PINMUX_AF('I', 4, AF3)

/* TIMER7_CH0 */
#define TIMER7_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF3)
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF3)
#define TIMER7_CH0_PI5 \
	GD32_PINMUX_AF('I', 5, AF3)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA5 \
	GD32_PINMUX_AF('A', 5, AF3)
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF3)
#define TIMER7_CH0_ON_PC6 \
	GD32_PINMUX_AF('C', 6, AF1)
#define TIMER7_CH0_ON_PH13 \
	GD32_PINMUX_AF('H', 13, AF3)

/* TIMER7_CH1 */
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF3)
#define TIMER7_CH1_PD14 \
	GD32_PINMUX_AF('D', 14, AF3)
#define TIMER7_CH1_PI6 \
	GD32_PINMUX_AF('I', 6, AF3)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PA4 \
	GD32_PINMUX_AF('A', 4, AF3)
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF3)
#define TIMER7_CH1_ON_PB14 \
	GD32_PINMUX_AF('B', 14, AF3)
#define TIMER7_CH1_ON_PH14 \
	GD32_PINMUX_AF('H', 14, AF3)

/* TIMER7_CH2 */
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF3)
#define TIMER7_CH2_PG1 \
	GD32_PINMUX_AF('G', 1, AF3)
#define TIMER7_CH2_PI7 \
	GD32_PINMUX_AF('I', 7, AF3)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF3)
#define TIMER7_CH2_ON_PB15 \
	GD32_PINMUX_AF('B', 15, AF3)
#define TIMER7_CH2_ON_PC0 \
	GD32_PINMUX_AF('C', 0, AF3)
#define TIMER7_CH2_ON_PH15 \
	GD32_PINMUX_AF('H', 15, AF3)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF3)
#define TIMER7_CH3_PE1 \
	GD32_PINMUX_AF('E', 1, AF3)
#define TIMER7_CH3_PI2 \
	GD32_PINMUX_AF('I', 2, AF3)

/* TIMER7_CH3_ON */
#define TIMER7_CH3_ON_PD1 \
	GD32_PINMUX_AF('D', 1, AF3)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF3)
#define TIMER7_ETI_PI3 \
	GD32_PINMUX_AF('I', 3, AF3)

/* TIMER8_CH0 */
#define TIMER8_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF3)
#define TIMER8_CH0_PE5 \
	GD32_PINMUX_AF('E', 5, AF3)

/* TIMER8_CH1 */
#define TIMER8_CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF3)
#define TIMER8_CH1_PE6 \
	GD32_PINMUX_AF('E', 6, AF3)

/* TIMER9_CH0 */
#define TIMER9_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF3)
#define TIMER9_CH0_PF6 \
	GD32_PINMUX_AF('F', 6, AF3)

/* TLI_B0 */
#define TLI_B0_PE4 \
	GD32_PINMUX_AF('E', 4, AF14)

/* TLI_B1 */
#define TLI_B1_PG12 \
	GD32_PINMUX_AF('G', 12, AF14)

/* TLI_B2 */
#define TLI_B2_PD6 \
	GD32_PINMUX_AF('D', 6, AF14)
#define TLI_B2_PG10 \
	GD32_PINMUX_AF('G', 10, AF14)

/* TLI_B3 */
#define TLI_B3_PD10 \
	GD32_PINMUX_AF('D', 10, AF14)
#define TLI_B3_PG11 \
	GD32_PINMUX_AF('G', 11, AF14)

/* TLI_B4 */
#define TLI_B4_PE12 \
	GD32_PINMUX_AF('E', 12, AF14)
#define TLI_B4_PG12 \
	GD32_PINMUX_AF('G', 12, AF9)
#define TLI_B4_PI4 \
	GD32_PINMUX_AF('I', 4, AF14)

/* TLI_B5 */
#define TLI_B5_PA3 \
	GD32_PINMUX_AF('A', 3, AF14)
#define TLI_B5_PI5 \
	GD32_PINMUX_AF('I', 5, AF14)

/* TLI_B6 */
#define TLI_B6_PB8 \
	GD32_PINMUX_AF('B', 8, AF14)
#define TLI_B6_PI6 \
	GD32_PINMUX_AF('I', 6, AF14)

/* TLI_B7 */
#define TLI_B7_PB9 \
	GD32_PINMUX_AF('B', 9, AF14)
#define TLI_B7_PI7 \
	GD32_PINMUX_AF('I', 7, AF14)

/* TLI_DE */
#define TLI_DE_PE13 \
	GD32_PINMUX_AF('E', 13, AF14)
#define TLI_DE_PF10 \
	GD32_PINMUX_AF('F', 10, AF14)

/* TLI_G0 */
#define TLI_G0_PE5 \
	GD32_PINMUX_AF('E', 5, AF14)

/* TLI_G1 */
#define TLI_G1_PE6 \
	GD32_PINMUX_AF('E', 6, AF14)

/* TLI_G2 */
#define TLI_G2_PA6 \
	GD32_PINMUX_AF('A', 6, AF14)
#define TLI_G2_PH13 \
	GD32_PINMUX_AF('H', 13, AF14)

/* TLI_G3 */
#define TLI_G3_PE11 \
	GD32_PINMUX_AF('E', 11, AF14)
#define TLI_G3_PG10 \
	GD32_PINMUX_AF('G', 10, AF9)
#define TLI_G3_PH14 \
	GD32_PINMUX_AF('H', 14, AF14)

/* TLI_G4 */
#define TLI_G4_PB10 \
	GD32_PINMUX_AF('B', 10, AF14)
#define TLI_G4_PH15 \
	GD32_PINMUX_AF('H', 15, AF14)

/* TLI_G5 */
#define TLI_G5_PB11 \
	GD32_PINMUX_AF('B', 11, AF14)
#define TLI_G5_PI0 \
	GD32_PINMUX_AF('I', 0, AF14)

/* TLI_G6 */
#define TLI_G6_PC7 \
	GD32_PINMUX_AF('C', 7, AF14)
#define TLI_G6_PI1 \
	GD32_PINMUX_AF('I', 1, AF14)

/* TLI_G7 */
#define TLI_G7_PD3 \
	GD32_PINMUX_AF('D', 3, AF14)
#define TLI_G7_PI2 \
	GD32_PINMUX_AF('I', 2, AF14)

/* TLI_HSYNC */
#define TLI_HSYNC_PC6 \
	GD32_PINMUX_AF('C', 6, AF14)
#define TLI_HSYNC_PI10 \
	GD32_PINMUX_AF('I', 10, AF14)

/* TLI_PIXCLK */
#define TLI_PIXCLK_PE14 \
	GD32_PINMUX_AF('E', 14, AF14)
#define TLI_PIXCLK_PG7 \
	GD32_PINMUX_AF('G', 7, AF14)

/* TLI_R0 */
#define TLI_R0_PH2 \
	GD32_PINMUX_AF('H', 2, AF14)

/* TLI_R1 */
#define TLI_R1_PH3 \
	GD32_PINMUX_AF('H', 3, AF14)

/* TLI_R2 */
#define TLI_R2_PC10 \
	GD32_PINMUX_AF('C', 10, AF14)
#define TLI_R2_PH8 \
	GD32_PINMUX_AF('H', 8, AF14)

/* TLI_R3 */
#define TLI_R3_PB0 \
	GD32_PINMUX_AF('B', 0, AF9)
#define TLI_R3_PH9 \
	GD32_PINMUX_AF('H', 9, AF14)

/* TLI_R4 */
#define TLI_R4_PA11 \
	GD32_PINMUX_AF('A', 11, AF14)
#define TLI_R4_PH10 \
	GD32_PINMUX_AF('H', 10, AF14)

/* TLI_R5 */
#define TLI_R5_PA12 \
	GD32_PINMUX_AF('A', 12, AF14)
#define TLI_R5_PH11 \
	GD32_PINMUX_AF('H', 11, AF14)

/* TLI_R6 */
#define TLI_R6_PA8 \
	GD32_PINMUX_AF('A', 8, AF14)
#define TLI_R6_PB1 \
	GD32_PINMUX_AF('B', 1, AF9)
#define TLI_R6_PH12 \
	GD32_PINMUX_AF('H', 12, AF14)

/* TLI_R7 */
#define TLI_R7_PE15 \
	GD32_PINMUX_AF('E', 15, AF14)
#define TLI_R7_PG6 \
	GD32_PINMUX_AF('G', 6, AF14)

/* TLI_VSYNC */
#define TLI_VSYNC_PA4 \
	GD32_PINMUX_AF('A', 4, AF14)
#define TLI_VSYNC_PI9 \
	GD32_PINMUX_AF('I', 9, AF14)

/* TRACECLK */
#define TRACECLK_PE2 \
	GD32_PINMUX_AF('E', 2, AF0)

/* TRACED0 */
#define TRACED0_PC8 \
	GD32_PINMUX_AF('C', 8, AF0)
#define TRACED0_PE3 \
	GD32_PINMUX_AF('E', 3, AF0)

/* TRACED1 */
#define TRACED1_PD3 \
	GD32_PINMUX_AF('D', 3, AF0)
#define TRACED1_PE4 \
	GD32_PINMUX_AF('E', 4, AF0)

/* TRACED2 */
#define TRACED2_PE5 \
	GD32_PINMUX_AF('E', 5, AF0)
#define TRACED2_PG13 \
	GD32_PINMUX_AF('G', 13, AF0)

/* TRACED3 */
#define TRACED3_PE6 \
	GD32_PINMUX_AF('E', 6, AF0)
#define TRACED3_PG14 \
	GD32_PINMUX_AF('G', 14, AF0)

/* TRACESWO */
#define TRACESWO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

